export { literalTemplate };

const literalTemplate = {
  number: {
    valid: [
      "0",
      "8",
      "1921291",
      "1.11",
      "11.1",
      "11.1",
      "0.111",
      "-1.11",
      "-11.1",
      "-11.1",
      "2342341.111111111",
    ],
    invalid: ["1.1.1", "1231.111-", "1231.111+", "1231.111e", "1231.111e-"],
  },
  string: {
    valid: [
      '"123"',
      "'1111'",
      "`wwlklksdldfs.1111`",
      '"钅耂阝赛三三三朩"',
      "` 嗯？三地方似懂非懂赛  非非`",
    ],
    invalid: [
      '"123',
      "'1111",
      "`wwlklksdldfs.1111",
      "钅耂阝赛三三三朩",
      "123,..？？？。*！！@）&￥@&￥啊哦好",
    ],
  },
};
